Incluindo diagrama de deploy usando Mermaid
